"""
Constants and mappings for the Abjad Calculator.
"""
MALFUZI_QAMARI_VALUES = {
    'ا': 111,     'أ': 111,    'إ': 111,    'آ': 111,    # Alif variations
    'ب': 3,
    'ج': 53,
    'د': 35,
    'ه': 6,    'ة': 6,  'ہ': 6,  # Ha variations
    'و': 13,
    'ز': 8,
    'ح': 9,
    'ط': 10,
    'ي': 11,   'ى': 11,   'ئ': 11, 'ی': 11,  # Ya variations
    'ك': 101,
    'ل': 71,
    'م': 90,
    'ن': 106,
    'س': 120,
    'ع': 130,
    'ف': 81,
    'ص': 95,
    'ق': 181,
    'ر': 201,
    'ش': 360,
    'ت': 401,
    'ث': 501,
    'خ': 601,
    'ذ': 731,
    'ض': 805,
    'ظ': 901,
    'غ': 1060
}

# Standard Abjad value mappings
QAMARI_VALUES = {
    'ا': 1,    'أ': 1,    'إ': 1,    'آ': 1,    # Alif variations
    'ب': 2,
    'ج': 3,
    'د': 4,
    'ه': 5,    'ة': 5,  'ہ': 5,  # Ha variations
    'و': 6,
    'ز': 7,
    'ح': 8,
    'ط': 9,
    'ي': 10,   'ى': 10,   'ئ': 10, 'ی': 10,  # Ya variations
    'ك': 20,
    'ل': 30,
    'م': 40,
    'ن': 50,
    'س': 60,
    'ع': 70,
    'ف': 80,
    'ص': 90,
    'ق': 100,
    'ر': 200,
    'ش': 300,
    'ت': 400,
    'ث': 500,
    'خ': 600,
    'ذ': 700,
    'ض': 800,
    'ظ': 900,
    'غ': 1000
}

BAYENATI_VALUES = {
    'ا': 110,     'أ': 110,    'إ': 110,    'آ': 110,
    'ب': 1,
    'ج': 50,
    'د': 31,
    'ه': 1,    'ة': 1,  'ہ': 1,
    'و': 7,
    'ز': 1,
    'ح': 1,
    'ط': 1,
    'ي': 1,   'ى': 1,   'ئ': 1, 'ی': 1,
    'ك': 81,
    'ل': 41,
    'م': 50,
    'ن': 56,
    'س': 60,
    'ع': 60,
    'ف': 1,
    'ص': 5,
    'ق': 81,
    'ر': 1,
    'ش': 60,
    'ت': 1,
    'ث': 1,
    'خ': 1,
    'ذ': 31,
    'ض': 5,
    'ظ': 1,
    'غ': 60
}

# Special characters to remove before processing
REMOVE_CHARS = [
    'ً', 'ٌ', 'ٍ', 'َ', 'ُ', 'ِ', 'ّ', 'ْ', 'ٰ', 'ٓ', 'ۚ', '۟', '۠', 'ۡ', 
    'ۢ', 'ۣ', 'ۤ', 'ۥ', 'ۦ', '۩', '۪', '۫', '۬', 'ۭ',  # Diacritics
    ' ', '\n', '\t'  # Whitespace
]

# Pre-defined texts for naqsh generation
PRESET_TEXTS = {
    "bastam_dard_sar": "ب س ت م د ر د س ر",
    "bastam_dard_kamar": "ب س ت م د ر د ك م ر",
    "huruf_sawamat": "ا ح د ر س ص ط ع ك ل م و ه",
}
